Julianiolo/ATmega32u4_Emulator/src/extras/Disassember.cpp
	uint16_t addr = generateAddrFromLine(start, end);
	MCU_ASSERT(!isProgramLine || (addr % 2 == 0 || addr == Addrs_notAnAddr || addr == Addrs_symbolLabel)); // addresses should always be round, since they refer to 2*PC
	if(lineInd >= addrs.size()){
		addrs.resize(lineInd);
	}
	addrs[lineInd-1] = addr;

	if (addr == Addrs_symbolLabel) {
		// should never be bigger than 2 bytes
		addrmcu_t symbAddr = (addrmcu_t)StringUtils::hexStrToUIntLen<uint64_t>(start, 8);
		labels[symbAddr] = lineInd-1;
	}
}

void A32u4::Disassembler::DisasmFile::processBranches() {
	maxBranchDisplayDepth = 0;
	branchRoots.clear();
	branchRootInds.clear();

	branchRootInds.resize(lines.size(), -1);
	
	{
		auto start0 = std::chrono::high_resolution_clock::now();
		std::vector<std::vector<size_t>> passingBranches(lines.size()); // raw representation, that later gets compressed into passingBranchesInds and passingBranchesVec; [lineno] = vector of inds of passing branches
		for (size_t i = 0; i < lines.size(); i++) {
			if (!isLineProgram[i])
				continue;

			addrmcu_t addr = addrs[i];
			if (addr != Addrs_notAnAddr && addr != Addrs_symbolLabel) {
				addrmcu_t dest;
				// get dest address
				{
					const char* lineStart = content.c_str() + lines[i];
					//const char* line_end = content.c_str() + ((i + 1 < lines.size()) ? lines[i] : content.size());

					uint16_t word = ( StringUtils::hexStrToUIntLen<uint16_t>(lineStart+FileConsts::instBytesStart,   2)) |
						( StringUtils::hexStrToUIntLen<uint16_t>(lineStart+FileConsts::instBytesStart+3, 2) << 8);
					uint16_t word2 = 0;
					if(*(lineStart+FileConsts::instBytesStart+3+3) != ' ') {
						word2 =		( StringUtils::hexStrToUIntLen<uint16_t>(lineStart+FileConsts::instBytesStart+3+3,   2)) |
							( StringUtils::hexStrToUIntLen<uint16_t>(lineStart+FileConsts::instBytesStart+3+3+3, 2) << 8);
					}

					pc_t destPC = Disassembler::getJumpDests(word,word2,addr/2);
					if (destPC == (pc_t)-1)
						continue; // instruction doesn't jump anywhere
					dest = destPC * 2;
				}

				size_t destLine = getLineIndFromAddr(dest);

				if (destLine == (decltype(destLine))-1 || addrs[destLine]%2 == 1) // for whatever reason, sometimes programs have illegal jumps like negative addresses or odd addresses
					continue;

				MCU_ASSERT(addrs[destLine] == dest);

				size_t branchRootInd = branchRoots.size();
				branchRootInds[i] = branchRootInd;

				branchRoots.push_back(BranchRoot());
				BranchRoot& branchRoot = branchRoots.back();
				branchRoot.start = addr;
				branchRoot.dest = dest;
				branchRoot.startLine = i;
				branchRoot.destLine = destLine;



				size_t from = std::min(i, destLine);
				size_t to = std::max(i, destLine);

				for (size_t l = from; l <= to; l++) {
					auto& passing = passingBranches[l];
					passing.push_back(branchRootInd);
				}

				branchRoot.displayDepth = -1;
			}
		}
		auto end0 = std::chrono::high_resolution_clock::now();
		
		{
			double ms = std::chrono::duration_cast<std::chrono::microseconds>(end0 - start0).count()/1000.0;
			MCU_LOG_M(ATmega32u4::LogLevel_DebugOutput, StringUtils::format("branch init took: %f ms", ms), "Disassembler");
		}


		// now we compress passingBranches into passingBranchesInds and passingBranchesVec

		auto start1 = std::chrono::high_resolution_clock::now();

		passingBranchesInds.clear();
		passingBranchesVec.clear();
		passingBranchesInds.resize(lines.size(), -1);

		std::vector<size_t>* last = nullptr;
		for (size_t i = 0; i < passingBranches.size(); i++) {
			if (!last || passingBranches[i].size() != last->size() || passingBranches[i] != *last) {
				PassingBranchs pb;
				pb.passing = passingBranches[i];
				pb.startLine = i;
				passingBranchesVec.push_back(pb);
				last = &passingBranches[i];
			}
			passingBranchesInds[i] = passingBranchesVec.size() - 1;
		}

		auto end1 = std::chrono::high_resolution_clock::now();
		{
			double ms = std::chrono::duration_cast<std::chrono::microseconds>(end1 - start1).count()/1000.0;
			MCU_LOG_M(ATmega32u4::LogLevel_DebugOutput, 
				StringUtils::format("branch comp took: %f ms; %" MCU_PRIuSIZE "=>%" MCU_PRIuSIZE " [%" MCU_PRIuSIZE " bs,%" MCU_PRIuSIZE " lines]", 
					ms, 
					passingBranches.size(), passingBranchesVec.size(),
					branchRoots.size(), lines.size()
				), 
				"Disassembler"
			);
		}
	}
	
	#if 1
	{
		auto start = std::chrono::high_resolution_clock::now();
		#if 0
		for(size_t i = 0; i<passingBranchesVec.size(); i++) {
			processBranchesRecurse(i);
		}
		#else
		for(size_t i = 0; i<branchRoots.size(); i++) {
			processBranchesRecurse(i);
		}
		#endif
		auto end = std::chrono::high_resolution_clock::now();
		{
			double ms = std::chrono::duration_cast<std::chrono::microseconds>(end - start).count()/1000.0;
			MCU_LOG_M(ATmega32u4::LogLevel_DebugOutput, StringUtils::format("branch recursion took: %f ms", ms), "Disassembler");
		}
	}
	#else
	{	
		auto start = std::chrono::high_resolution_clock::now();
		std::vector<size_t> branchsSorted(branchRoots.size());
		for(size_t i = 0; i<branchsSorted.size(); i++) {
			branchsSorted[i] = i;
		}

		std::sort(branchsSorted.begin(), branchsSorted.end(), [&](size_t a, size_t b) {
			return branchRoots[a].addrDist() < branchRoots[b].addrDist();
		});

		std::map<addrmcu_t,size_t> destMap;
		for(size_t i = 0; i< branchsSorted.size(); i++) {
			BranchRoot& branchRoot = branchRoots[branchsSorted[i]];

			const size_t from = std::min(branchRoot.startLine, branchRoot.destLine);
			const size_t to = std::max(branchRoot.startLine, branchRoot.destLine);
			
			const size_t fromInd = passingBranchesInds[from];

			{
				auto res = destMap.find(branchRoot.dest);
				if(res != destMap.end()) {
					branchRoot.displayDepth = res->second;
					goto skip;
				}
			}

			{

				BitArray<PassingBranchs::bitArrSize> occupied;
				size_t toInd = passingBranchesVec.size()-1;
				for (size_t c = fromInd; c < passingBranchesVec.size(); c++) { // go through line chunks
					PassingBranchs& pb = passingBranchesVec[c];

					if (pb.startLine > to) {
						toInd = c+1;
						break;
					}

